In [1]:
import pandas as pd

india_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
india_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [2]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [3]:
df=pd.concat([india_weather,us_weather])

In [4]:
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
df=pd.concat([india_weather,us_weather],ignore_index=True)

In [6]:
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [13]:
df=pd.concat([india_weather,us_weather],ignore_index=False,keys=["india","us"],axis=1)
df

      india                             us
       city temperature humidity      city temperature humidity
0    mumbai          32       80  new york          21       68
1     delhi          45       60   chicago          14       65
2  banglore          30       78   orlando          35       75

In [15]:
df.columns

MultiIndex([('india',        'city'),
            ('india', 'temperature'),
            ('india',    'humidity'),
            (   'us',        'city'),
            (   'us', 'temperature'),
            (   'us',    'humidity')],
           )

In [16]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
}, index=[0,1,2])
windspeed_df = pd.DataFrame({
    "city": ["delhi","mumbai"],
    "windspeed": [7,12],
}, index=[1,0])

In [20]:
df=pd.concat([temperature_df,windspeed_df],join="outer")
df

       city  temperature  windspeed
0    mumbai         32.0        NaN
1     delhi         45.0        NaN
2  banglore         30.0        NaN
1     delhi          NaN        7.0
0    mumbai          NaN       12.0